isparkes/millclock-burner6-code/src/ESP32MenuSystem.cpp
/*
 * ESP32MenuSystem.cpp
 * Implementation of the ESP32 Menu System Library
 */

 #include "ESP32MenuSystem.h"

 // Static instance for ISR access
 MenuSystem* MenuSystem::instance = NULL;
 
 // Default character set for string composition
 const char DEFAULT_CHARSET[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+@#*%&/()=?!$-_ ";
 
 // Constructor
 MenuSystem::MenuSystem(uint8_t width, uint8_t height, int8_t resetPin) 
   : screenWidth(width), screenHeight(height), rootMenu(NULL), currentMenu(NULL),
     selectedItem(NULL), selectedIndex(0), scrollOffset(0), visibleItems(4),
     currentMode(MODE_STATUS_SCREEN), encoderPosition(0), lastEncoderTime(0),
     lastEncoderState(0), encoderPulseCount(0), confirmPressed(false), backPressed(false), 
     encoderSwPressed(false), screenSaverTimeout(0), lastActivityTime(0), 
     screenSaverActive(false), lastMenuActivity(0), statusData(NULL) {
   
   display = new Adafruit_SH1106G(width, height, &Wire, resetPin);
   instance = this;
 }
 
 // Destructor
 MenuSystem::~MenuSystem() {
   if (display) {
     delete display;
   }
 }
 
 // ISR Handlers
 void IRAM_ATTR MenuSystem::encoderISR() {
   if (!instance) return;
   
   uint8_t clkState = digitalRead(instance->encoderClkPin);
   uint8_t dtState = digitalRead(instance->encoderDtPin);
   
   // Simple quadrature decoding - count raw pulses
   if (clkState != instance->lastEncoderState) {
     if (dtState != clkState) {
       instance->encoderPulseCount++;
     } else {
       instance->encoderPulseCount--;
     }
     
     // Only increment position every N pulses
     if (instance->encoderPulseCount >= instance->encoderPulsesPerStep) {
       instance->encoderPosition++;
       instance->encoderPulseCount = 0;
     } else if (instance->encoderPulseCount <= -instance->encoderPulsesPerStep) {
       instance->encoderPosition--;
       instance->encoderPulseCount = 0;
     }
     
     instance->lastEncoderTime = millis();
   }
   instance->lastEncoderState = clkState;
 }
 
 void IRAM_ATTR MenuSystem::confirmISR() {
   if (!instance) return;
   instance->confirmPressed = true;
   instance->confirmPressTime = millis();
 }
 
 void IRAM_ATTR MenuSystem::backISR() {
   if (!instance) return;
   instance->backPressed = true;
   instance->backPressTime = millis();
 }
 
 void IRAM_ATTR MenuSystem::encoderSwISR() {
   if (!instance) return;
   instance->encoderSwPressed = true;
   instance->encoderSwPressTime = millis();
 }
 
 // Initialize the menu system
 bool MenuSystem::begin(uint8_t sdaPin, uint8_t sclPin, 
                        uint8_t encClk, uint8_t encDt, 
                        uint8_t btnConfirm, uint8_t btnBack,
                        uint8_t encSw) {
   
   // Store pin assignments
   encoderClkPin = encClk;
   encoderDtPin = encDt;
   encoderSwPin = encSw;
   confirmPin = btnConfirm;
   backPin = btnBack;
   
   // Initialize I2C
   Wire.begin(sdaPin, sclPin);
   
   // Initialize display
   display->begin(0x3C, true); // Address 0x3C, reset=true
   
   display->clearDisplay();
   display->setTextSize(1);
   display->setTextColor(SH110X_WHITE);
   display->display();
   
   // Setup encoder pins
   pinMode(encoderClkPin, INPUT_PULLUP);
   pinMode(encoderDtPin, INPUT_PULLUP);
   attachInterrupt(digitalPinToInterrupt(encoderClkPin), encoderISR, CHANGE);
   attachInterrupt(digitalPinToInterrupt(encoderDtPin), encoderISR, CHANGE);
   
   lastEncoderState = digitalRead(encoderClkPin);
   
   // Setup button pins
   pinMode(confirmPin, INPUT_PULLUP);
   pinMode(backPin, INPUT_PULLUP);
   attachInterrupt(digitalPinToInterrupt(confirmPin), confirmISR, FALLING);
   attachInterrupt(digitalPinToInterrupt(backPin), backISR, FALLING);
   
   if (encSw != 255) {
     pinMode(encoderSwPin, INPUT_PULLUP);
     attachInterrupt(digitalPinToInterrupt(encoderSwPin), encoderSwISR, FALLING);
   }
   
   // Initialize activity timer
   lastActivityTime = millis();
   
   return true;
 }
 
 // Create a new menu
 MenuItem* MenuSystem::createMenu(const char* title) {
   MenuItem* menu = new MenuItem(title, MENU_ITEM_SUBMENU);
   return menu;
 }
 
 // Set root menu
 void MenuSystem::setRootMenu(MenuItem* menu) {
   rootMenu = menu;
   currentMenu = menu;
   selectedItem = menu->child;
   selectedIndex = 0;
   scrollOffset = 0;
 }
 
 // Add submenu item
 MenuItem* MenuSystem::addSubmenu(MenuItem* parent, const char* label, MenuItem* submenu) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_SUBMENU);
   item->parent = parent;
   item->child = submenu;
   submenu->parent = item;
   
   // Add to parent's child list
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Add action item
 MenuItem* MenuSystem::addAction(MenuItem* parent, const char* label, ActionCallback callback) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_ACTION);
   item->parent = parent;
   item->data.actionCallback = callback;
   
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Add numeric value item
 MenuItem* MenuSystem::addNumericValue(MenuItem* parent, const char* label, int* valuePtr,
                                      int minVal, int maxVal, int step, const char* unit) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_NUMERIC_VALUE);
   item->parent = parent;
   item->data.numericData.valuePtr = valuePtr;
   item->data.numericData.minValue = minVal;
   item->data.numericData.maxValue = maxVal;
   item->data.numericData.step = step;
   item->data.numericData.unit = unit;
   
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Add string value item
 MenuItem* MenuSystem::addStringValue(MenuItem* parent, const char* label, char* buffer,
                                     uint8_t maxLen, const char* charset) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_STRING_VALUE);
   item->parent = parent;
   item->data.stringData.buffer = buffer;
   item->data.stringData.maxLength = maxLen;
   item->data.stringData.charset = charset ? charset : DEFAULT_CHARSET;
   
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Add either-or item
 MenuItem* MenuSystem::addEitherOr(MenuItem* parent, const char* label, bool* valuePtr,
                                  const char* opt1, const char* opt2) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_EITHER_OR);
   item->parent = parent;
   item->data.eitherOrData.valuePtr = valuePtr;
   item->data.eitherOrData.option1 = opt1;
   item->data.eitherOrData.option2 = opt2;
   
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Add info item
 MenuItem* MenuSystem::addInfo(MenuItem* parent, const char* label) {
   MenuItem* item = new MenuItem(label, MENU_ITEM_INFO);
   item->parent = parent;
   
   if (parent->child == NULL) {
     parent->child = item;
   } else {
     MenuItem* last = parent->child;
     while (last->next) last = last->next;
     last->next = item;
   }
   
   return item;
 }
 
 // Get menu item count
 uint8_t MenuSystem::getMenuItemCount(MenuItem* menu) {
   if (!menu) return 0;
   
   uint8_t count = 0;
   MenuItem* item = menu->child;
   while (item) {
     count++;
     item = item->next;
   }
   
