isparkes/millclock-burner6-code/src/ESP32MenuSystem.cpp
   return count;
 }
 
 // Get item at index
 MenuItem* MenuSystem::getItemAtIndex(uint8_t index) {
   if (!currentMenu) return NULL;
   
   MenuItem* item = currentMenu->child;
   for (uint8_t i = 0; i < index && item; i++) {
     item = item->next;
   }

   return item;
 }
 
 // Check button events
 ButtonEvent MenuSystem::checkButtons() {
   unsigned long now = millis();
   
   if (confirmPressed && (now - confirmPressTime) > debounceDelay) {
     confirmPressed = false;
     if (digitalRead(confirmPin) == LOW) {
       debugMsgMnm("[BTN] Confirm button pressed");
       if ((now - confirmPressTime) > longPressDelay) {
         debugMsgMnm("[BTN] Confirm LONG press");
         return BTN_CONFIRM_LONG;
       }
       debugMsgMnm("[BTN] Confirm CLICK");
       return BTN_CONFIRM_CLICK;
     }
   }
   
   if (backPressed && (now - backPressTime) > debounceDelay) {
     backPressed = false;
     if (digitalRead(backPin) == LOW) {
       debugMsgMnm("[BTN] Back button pressed");
       if ((now - backPressTime) > longPressDelay) {
         debugMsgMnm("[BTN] Back LONG press");
         return BTN_BACK_LONG;
       }
       debugMsgMnm("[BTN] Back CLICK");
       return BTN_BACK_CLICK;
     }
   }
   
   if (encoderSwPressed && (now - encoderSwPressTime) > debounceDelay) {
     encoderSwPressed = false;
     if (encoderSwPin != 255 && digitalRead(encoderSwPin) == LOW) {
       debugMsgMnm("[BTN] Encoder button pressed");
       debugMsgMnm("[BTN] Encoder CLICK");
       return BTN_ENCODER_CLICK;
     }
   }
   
   return BTN_NONE;
 }
 
 // Render status screen
 void MenuSystem::renderStatusScreen() {
   // If custom render callback is set, use it
   if (statusRenderCallback) {
     statusRenderCallback(display, screenWidth, screenHeight);
     return;
   }

   // Default rendering if no callback
   if (!statusData) {
     display->setTextSize(1);
     display->setCursor(20, 28);
     display->print("Press encoder");
     display->setCursor(30, 38);
     display->print("for menu");
     return;
   }

   display->setTextSize(1);
   uint8_t yPos = 2;

   // WiFi Status
   display->setCursor(0, yPos);
   display->print("WiFi: ");
   display->print(statusData->wifiConnected ? "Connected" : "Disconnected");
   yPos += 10;

   // IP Address (only if connected)
   if (statusData->wifiConnected && strlen(statusData->ipAddress) > 0) {
     display->setCursor(0, yPos);
     display->print("IP: ");
     display->print(statusData->ipAddress);
     yPos += 10;
   }

   // Separator
   display->drawLine(0, yPos + 2, screenWidth, yPos + 2, SH110X_WHITE);
   yPos += 6;

   // Show hint at bottom
   display->setCursor(0, screenHeight - 10);
   display->setTextSize(1);
   display->print("[Press Enc for Menu]");
 }
 
 // Enter menu item
 void MenuSystem::enterMenuItem(MenuItem* item) {
   if (!item) return;
   
   switch (item->type) {
     case MENU_ITEM_SUBMENU:
       if (item->child) {
         Serial.print("[MENU] Entering submenu: ");
         debugMsgMnm(item->label);
         currentMenu = item;
         selectedItem = item->child;
         selectedIndex = 0;
         scrollOffset = 0;
       }
       break;
       
     case MENU_ITEM_ACTION:
       if (item->data.actionCallback) {
         Serial.print("[ACTION] Executing callback for: ");
         debugMsgMnm(item->label);
         item->data.actionCallback();
       }
       break;
       
     case MENU_ITEM_NUMERIC_VALUE:
       Serial.print("[NUMERIC] Editing: ");
       debugMsgMnm(item->label);
       currentMode = MODE_NUMERIC_VALUE;
       editingValue = *(item->data.numericData.valuePtr);
       editingMin = item->data.numericData.minValue;
       editingMax = item->data.numericData.maxValue;
       editingStep = item->data.numericData.step;
       encoderPosition = 0;
       break;
       
     case MENU_ITEM_STRING_VALUE:
       Serial.print("[STRING] Editing: ");
       debugMsgMnm(item->label);
       currentMode = MODE_STRING_COMPOSITION;
       editingBuffer = item->data.stringData.buffer;
       editingMaxLen = item->data.stringData.maxLength;
       editingCharset = item->data.stringData.charset;
       editingCursorPos = strlen(editingBuffer);
       editingCharIndex = 0;
       encoderPosition = 0;
       break;
       
     case MENU_ITEM_EITHER_OR:
       Serial.print("[EITHER-OR] Editing: ");
       debugMsgMnm(item->label);
       currentMode = MODE_EITHER_OR;
       editingEitherOr = *(item->data.eitherOrData.valuePtr);
       encoderPosition = 0;
       break;
       
     case MENU_ITEM_INFO:
       Serial.print("[INFO] Displayed: ");
       debugMsgMnm(item->label);
       break;
   }
 }
 
 // Exit current editing mode
 void MenuSystem::exitCurrentMode() {
   currentMode = MODE_MENU_NAVIGATION;
   encoderPosition = 0;
 }
 
 // Main update loop
 void MenuSystem::update() {
   static int lastEncoderPos = 0;
   
   // Check for screen saver timeout
   if (screenSaverTimeout > 0) {
     unsigned long now = millis();
     if (!screenSaverActive && (now - lastActivityTime) > screenSaverTimeout) {
       screenSaverActive = true;
       display->clearDisplay();
       display->display();
       debugMsgMnm("[SCREEN] Screen saver activated");
       return;  // Don't process anything while screen saver is active
     }
   }
   
   // Check for menu timeout (return to status screen)
   if (currentMode != MODE_STATUS_SCREEN && statusData != NULL) {
     unsigned long now = millis();
     if ((now - lastMenuActivity) > menuTimeout) {
       debugMsgMnm("[MENU] Menu timeout - returning to status screen");
       showStatusScreen();
       return;
     }
   }
   
   // Handle encoder rotation
   if (encoderPosition != lastEncoderPos) {
     resetActivity();  // Reset screen saver on any activity
     if (currentMode != MODE_STATUS_SCREEN) {
       resetMenuActivity();  // Reset menu timeout
     }
     
     int delta = encoderPosition - lastEncoderPos;
     lastEncoderPos = encoderPosition;
     
     switch (currentMode) {
       case MODE_MENU_NAVIGATION: {
         int itemCount = getMenuItemCount(currentMenu);
         int newIndex = selectedIndex + delta;
         
