isparkes/millclock-burner6-code/src/ESP32MenuSystem.cpp
         // Clamp to valid range - no wraparound
         if (newIndex < 0) newIndex = 0;
         if (newIndex >= itemCount) newIndex = itemCount - 1;
         
         // Only update if index actually changed
         if (newIndex != selectedIndex) {
           selectedIndex = newIndex;
           selectedItem = getItemAtIndex(selectedIndex);
           
           // Adjust scroll offset with proper bounds checking
           if (itemCount <= visibleItems) {
             // All items fit on screen, no scrolling needed
             scrollOffset = 0;
           } else {
             // Items don't all fit, need to scroll
             if (selectedIndex < scrollOffset) {
               // Selected item is above visible area
               scrollOffset = selectedIndex;
             } else if (selectedIndex > scrollOffset + visibleItems - 1) {
               // Selected item is below visible area
               scrollOffset = selectedIndex - visibleItems + 1;
             }
             
             // Ensure scroll offset doesn't go beyond valid range
             int maxScrollOffset = itemCount - visibleItems;
             if (scrollOffset > maxScrollOffset) {
               scrollOffset = maxScrollOffset;
             }
             if (scrollOffset < 0) {
               scrollOffset = 0;
             }
           }
         }
         
         break;
       }
       
       case MODE_NUMERIC_VALUE:
         editingValue += delta * editingStep;
         if (editingValue < editingMin) editingValue = editingMin;
         if (editingValue > editingMax) editingValue = editingMax;
         break;
         
       case MODE_STRING_COMPOSITION: {
         int charsetLen = strlen(editingCharset);
         editingCharIndex += delta;
         if (editingCharIndex < 0) editingCharIndex = charsetLen - 1;
         if (editingCharIndex >= charsetLen) editingCharIndex = 0;
         break;
       }
       
       case MODE_EITHER_OR:
         editingEitherOr = !editingEitherOr;
         break;
     }
   }
   
   // Handle button events
   ButtonEvent event = checkButtons();
   
   if (event != BTN_NONE) {
     resetActivity();  // Reset screen saver on any button press
     if (currentMode != MODE_STATUS_SCREEN) {
       resetMenuActivity();  // Reset menu timeout
     }
   }

   // Handle button events on status screen
   if (currentMode == MODE_STATUS_SCREEN && event != BTN_NONE) {
     // Call custom input callback if set - if it returns true, event was consumed
     if (statusInputCallback && statusInputCallback(event)) {
       return;
     }
     // Default: encoder click enters menu
     if (event == BTN_ENCODER_CLICK) {
       debugMsgMnm("[STATUS] Entering menu from status screen");
       showMenu();
       return;
     }
   }
   
   switch (event) {
     case BTN_CONFIRM_CLICK:
       if (currentMode == MODE_MENU_NAVIGATION) {
         Serial.print("[MENU] Entering item: ");
         debugMsgMnm(selectedItem ? selectedItem->label : "NULL");
         enterMenuItem(selectedItem);
       } else if (currentMode == MODE_NUMERIC_VALUE) {
         Serial.print("[VALUE] Saving numeric value: ");
         debugMsgMnm(String(editingValue));
         *(selectedItem->data.numericData.valuePtr) = editingValue;
         exitCurrentMode();
       } else if (currentMode == MODE_STRING_COMPOSITION) {
         // Confirm button finishes string entry
         Serial.print("[STRING] Saving string: ");
         debugMsgMnm(editingBuffer);
         exitCurrentMode();
       } else if (currentMode == MODE_EITHER_OR) {
         Serial.print("[EITHER-OR] Selected: ");
         debugMsgMnm(editingEitherOr ? selectedItem->data.eitherOrData.option1 : selectedItem->data.eitherOrData.option2);
         *(selectedItem->data.eitherOrData.valuePtr) = editingEitherOr;
         exitCurrentMode();
       }
       break;
     
     case BTN_ENCODER_CLICK:  // Encoder button adds character or selects in other modes
       if (currentMode == MODE_MENU_NAVIGATION) {
         Serial.print("[MENU] Entering item: ");
         debugMsgMnm(selectedItem ? selectedItem->label : "NULL");
         enterMenuItem(selectedItem);
       } else if (currentMode == MODE_NUMERIC_VALUE) {
         Serial.print("[VALUE] Saving numeric value: ");
         debugMsgMnm(String(editingValue));
         *(selectedItem->data.numericData.valuePtr) = editingValue;
         exitCurrentMode();
       } else if (currentMode == MODE_STRING_COMPOSITION) {
         // Encoder button adds the current character
         if (editingCursorPos < editingMaxLen - 1) {
           editingBuffer[editingCursorPos] = editingCharset[editingCharIndex];
           Serial.print("[STRING] Added character: ");
           debugMsgMnm(String(editingCharset[editingCharIndex]));
           editingCursorPos++;
           editingBuffer[editingCursorPos] = '\0';
           editingCharIndex = 0;
         } else {
           Serial.print("[STRING] Max length reached, saving: ");
           debugMsgMnm(editingBuffer);
           exitCurrentMode();
         }
       } else if (currentMode == MODE_EITHER_OR) {
         Serial.print("[EITHER-OR] Selected: ");
         debugMsgMnm(editingEitherOr ? selectedItem->data.eitherOrData.option1 : selectedItem->data.eitherOrData.option2);
         *(selectedItem->data.eitherOrData.valuePtr) = editingEitherOr;
         exitCurrentMode();
       }
       break;
       
     case BTN_BACK_CLICK:
       if (currentMode == MODE_MENU_NAVIGATION) {
         if (currentMenu->parent) {
           MenuItem* parent = currentMenu->parent;
           Serial.print("[MENU] Going back from: ");
           Serial.print(currentMenu->label);
           Serial.print(" to: ");
           debugMsgMnm(parent->parent ? parent->parent->label : rootMenu->label);
           
           currentMenu = parent->parent ? parent->parent : rootMenu;
           selectedItem = parent;
           
           // Find index of parent item
           selectedIndex = 0;
           MenuItem* item = currentMenu->child;
           while (item && item != parent) {
             selectedIndex++;
             item = item->next;
           }
           scrollOffset = 0;
         } else {
           // At root menu - return to status screen
          debugMsgMnm("[MENU] At root, returning to status screen");
          showStatusScreen();
         }
       } else if (currentMode == MODE_STRING_COMPOSITION) {
         if (editingCursorPos > 0) {
           editingCursorPos--;
           editingBuffer[editingCursorPos] = '\0';
           Serial.print("[STRING] Deleted character, now: ");
           debugMsgMnm(editingBuffer);
         } else {
           debugMsgMnm("[STRING] Cancelled string editing");
           exitCurrentMode();
         }
       } else {
         debugMsgMnm("[MENU] Cancelled editing mode");
         exitCurrentMode();
       }
       break;
       
     default:
       break;
   }
   
   // Render current mode
   display->clearDisplay();
   
