isparkes/millclock-burner6-code/src/ESP32MenuSystem.cpp
   switch (currentMode) {
     case MODE_STATUS_SCREEN:
       renderStatusScreen();
       break;
     case MODE_MENU_NAVIGATION:
       renderMenuNavigation();
       break;
     case MODE_NUMERIC_VALUE:
       renderNumericValue();
       break;
     case MODE_STRING_COMPOSITION:
       renderStringComposition();
       break;
     case MODE_EITHER_OR:
       renderEitherOr();
       break;
   }
   
   display->display();
 }
 
 // Render menu navigation
 void MenuSystem::renderMenuNavigation() {
   const uint8_t lineHeight = 12;
   const uint8_t titleHeight = 12;
   const uint8_t startY = titleHeight + 2;
   
   // Draw title bar (always visible)
   display->setTextSize(1);
   display->setCursor(0, 0);
   display->print(currentMenu->label);
   display->drawLine(0, 10, screenWidth, 10, SH110X_WHITE);
   
   // Calculate available space for menu items
   uint8_t availableHeight = screenHeight - startY - 2;
   uint8_t maxVisibleItems = availableHeight / lineHeight;
   
   // Draw menu items
   MenuItem* item = currentMenu->child;
   uint8_t index = 0;
   
   // Skip to scroll offset
   for (uint8_t i = 0; i < scrollOffset && item; i++) {
     item = item->next;
     index++;
   }
   
   // Serial.print("[RENDER] Starting from index: ");
   // debugMsgMnm(index);
   
   // Draw visible items
   uint8_t yPos = startY;
   uint8_t itemsDrawn = 0;
   while (item && itemsDrawn < maxVisibleItems && yPos + lineHeight <= screenHeight) {     
     if (index == selectedIndex) {
       display->fillRect(0, yPos, screenWidth, lineHeight, SH110X_WHITE);
       display->setTextColor(SH110X_BLACK);
     } else {
       display->setTextColor(SH110X_WHITE);
     }
     
     display->setCursor(4, yPos + 2);
     display->print(item->label);
     
     // Draw indicators
     if (item->type == MENU_ITEM_SUBMENU) {
       display->setCursor(screenWidth - 10, yPos + 2);
       display->print(">");
     }
     
     display->setTextColor(SH110X_WHITE);  // Reset color
     yPos += lineHeight;
     item = item->next;
     index++;
     itemsDrawn++;
   }
 }
 
 // Render numeric value editing
 void MenuSystem::renderNumericValue() {
   display->setTextSize(1);
   display->setCursor(0, 0);
   display->print(selectedItem->label);
   display->drawLine(0, 10, screenWidth, 10, SH110X_WHITE);
   
   // Draw large value
   display->setTextSize(3);
   char valueStr[16];
   snprintf(valueStr, 16, "%d", editingValue);
   
   int16_t x1, y1;
   uint16_t w, h;
   display->getTextBounds(valueStr, 0, 0, &x1, &y1, &w, &h);
   display->setCursor((screenWidth - w) / 2, 28);
   display->print(valueStr);
   
   // Draw unit
   if (selectedItem->data.numericData.unit && strlen(selectedItem->data.numericData.unit) > 0) {
     display->setTextSize(1);
     display->setCursor((screenWidth - w) / 2 + w + 4, 40);
     display->print(selectedItem->data.numericData.unit);
   }
   
   // Draw range
   display->setTextSize(1);
   display->setCursor(0, screenHeight - 10);
   display->print(editingMin);
   snprintf(valueStr, 16, "%d", editingMax);
   display->getTextBounds(valueStr, 0, 0, &x1, &y1, &w, &h);
   display->setCursor(screenWidth - w, screenHeight - 10);
   display->print(editingMax);
 }
 
 // Render string composition
 void MenuSystem::renderStringComposition() {
   display->setTextSize(1);
   display->setCursor(0, 0);
   display->print(selectedItem->label);
   display->drawLine(0, 10, screenWidth, 10, SH110X_WHITE);
   
   // Draw current string
   display->setCursor(2, 16);
   display->print(editingBuffer);
   display->print("_");
   
   // Draw character selector
   display->setTextSize(2);
   char currentChar[2] = {editingCharset[editingCharIndex], '\0'};
   
   int16_t x1, y1;
   uint16_t w, h;
   display->getTextBounds(currentChar, 0, 0, &x1, &y1, &w, &h);
   display->setCursor((screenWidth - w) / 2, 36);
   display->print(currentChar);
   
   // Draw prev/next indicators
   display->setTextSize(1);
   int charsetLen = strlen(editingCharset);
   int prevIdx = (editingCharIndex - 1 + charsetLen) % charsetLen;
   int nextIdx = (editingCharIndex + 1) % charsetLen;
   
   char prevChar[2] = {editingCharset[prevIdx], '\0'};
   char nextChar[2] = {editingCharset[nextIdx], '\0'};
   
   display->setCursor(4, 42);
   display->print(prevChar);
   
   display->setCursor(screenWidth - 10, 42);
   display->print(nextChar);
   
   // Instructions
   display->setCursor(0, screenHeight - 10);
   display->print("Enc:Add OK:Done");
 }
 
 // Render either-or selection
 void MenuSystem::renderEitherOr() {
   display->setTextSize(1);
   display->setTextColor(SH110X_WHITE);
   display->setCursor(0, 0);
   display->print(selectedItem->label);
   display->drawLine(0, 10, screenWidth, 10, SH110X_WHITE);
   
   const char* opt1 = selectedItem->data.eitherOrData.option1;
   const char* opt2 = selectedItem->data.eitherOrData.option2;
   
   // Draw options side by side
   uint8_t midX = screenWidth / 2;
   
   // Option 1
   if (editingEitherOr) {
     display->fillRect(0, 20, midX - 2, 30, SH110X_WHITE);
     display->setTextColor(SH110X_BLACK);
   } else {
     display->drawRect(0, 20, midX - 2, 30, SH110X_WHITE);
     display->setTextColor(SH110X_WHITE);
   }
   
   int16_t x1, y1;
   uint16_t w, h;
   display->setTextSize(2);
   display->getTextBounds(opt1, 0, 0, &x1, &y1, &w, &h);
   display->setCursor((midX - 2 - w) / 2, 28);
   display->print(opt1);

   // Reset text color after Option 1
   display->setTextColor(SH110X_WHITE);

   // Option 2
   if (!editingEitherOr) {
     display->fillRect(midX + 2, 20, midX - 2, 30, SH110X_WHITE);
     display->setTextColor(SH110X_BLACK);
   } else {
     display->drawRect(midX + 2, 20, midX - 2, 30, SH110X_WHITE);
     display->setTextColor(SH110X_WHITE);
   }

   display->getTextBounds(opt2, 0, 0, &x1, &y1, &w, &h);
   display->setCursor(midX + 2 + (midX - 2 - w) / 2, 28);
   display->print(opt2);

   // Reset text color at end
   display->setTextColor(SH110X_WHITE);
 }
 
 // Set display contrast
 void MenuSystem::setContrast(uint8_t contrast) {
   display->setContrast(contrast);
 }
 
 // Enable screen saver with timeout in milliseconds
 void MenuSystem::enableScreenSaver(unsigned long timeoutMs) {
   screenSaverTimeout = timeoutMs;
   lastActivityTime = millis();
   screenSaverActive = false;
   Serial.print("[SCREEN] Screen saver enabled with timeout: ");
   Serial.print(timeoutMs / 1000);
   debugMsgMnm(" seconds");
 }
 
 // Disable screen saver
 void MenuSystem::disableScreenSaver() {
   screenSaverTimeout = 0;
   screenSaverActive = false;
   debugMsgMnm("[SCREEN] Screen saver disabled");
 }
 
 // Reset activity timer (called on any user interaction)
 void MenuSystem::resetActivity() {
   lastActivityTime = millis();
   if (screenSaverActive) {
     screenSaverActive = false;
     debugMsgMnm("[SCREEN] Screen saver deactivated");
   }
 }
 
 // Reset menu activity timer
 void MenuSystem::resetMenuActivity() {
   lastMenuActivity = millis();
 }
 
