isparkes/millclock-burner6-code/src/ESP32MenuSystem.cpp
 // Set status data pointer
 void MenuSystem::setStatusData(StatusData* data) {
   statusData = data;
   debugMsgMnmX("[STATUS] Status data configured");
 }

 // Set custom status render callback
 void MenuSystem::setStatusRenderCallback(StatusRenderCallback callback) {
   statusRenderCallback = callback;
   debugMsgMnmX("[STATUS] Custom render callback configured");
 }

 // Set custom status input callback
 void MenuSystem::setStatusInputCallback(StatusInputCallback callback) {
   statusInputCallback = callback;
   debugMsgMnm("[STATUS] Custom input callback configured");
 }

 // Show status screen
 void MenuSystem::showStatusScreen() {
   currentMode = MODE_STATUS_SCREEN;
   debugMsgMnm("[STATUS] Showing status screen");
 }
 
 // Show menu
 void MenuSystem::showMenu() {
   if (rootMenu) {
     currentMode = MODE_MENU_NAVIGATION;
     currentMenu = rootMenu;
     selectedItem = rootMenu->child;
     selectedIndex = 0;
     scrollOffset = 0;
     resetMenuActivity();
     debugMsgMnm("[MENU] Showing menu");
   }
 }
 
 // Set menu timeout - this is the timeout to return to the status menu
 void MenuSystem::setMenuTimeout(unsigned long timeoutMs) {
   menuTimeout = timeoutMs;
   Serial.print("[MENU] Menu timeout set to: ");
   Serial.print(timeoutMs / 1000);
   debugMsgMnm(" seconds");
 }
 
 // Navigate to specific menu
 void MenuSystem::navigateToMenu(MenuItem* menu) {
   if (menu && menu->type == MENU_ITEM_SUBMENU) {
     currentMenu = menu;
     selectedItem = menu->child;
     selectedIndex = 0;
     scrollOffset = 0;
     resetActivity();
   }
 }